lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programas de Prueba/6. Progra Final Version 1.c
/*
 * File:   main.c
 * Author: Javier Lima
 *
 * Created on 28 de abril 2018, 08:26 PM
 */

//#include "C:\Program Files (x86)\Microchip\xc32\v1.44\pic32mx\include\p32xxxx.h"
//#include "C:\Program Files (x86)\Microchip\xc32\v1.44\pic32mx\include\xc.h"
#include <string.h>
#include <stdio.h>
//#include <stdlib.h>
#include <p32xxxx.h>
#include <stdlib.h>
#include <math.h>
#include <string.h>
#include "../sys/attribs.h"
// PIC32MX250F128B Configuration Bit Settings

// 'C' source line config statements

// DEVCFG3
// USERID = No Setting
#pragma config PMDL1WAY = ON           // Peripheral Module Disable Configuration (Allow multiple reconfigurations)
#pragma config IOL1WAY = ON            // Peripheral Pin Select Configuration (Allow multiple reconfigurations)
#pragma config FUSBIDIO = OFF           // USB USID Selection (Controlled by Port Function)
#pragma config FVBUSONIO = OFF          // USB VBUS ON Selection (Controlled by Port Function)

// DEVCFG2
#pragma config FPLLIDIV = DIV_2         // PLL Input Divider (2x Divider)
#pragma config FPLLMUL = MUL_20         // PLL Multiplier (20x Multiplier)
#pragma config UPLLIDIV = DIV_12        // USB PLL Input Divider (12x Divider)
#pragma config UPLLEN = OFF             // USB PLL Enable (Disabled and Bypassed)
#pragma config FPLLODIV = DIV_2         // System PLL Output Clock Divider (PLL Divide by 2)

// DEVCFG1
#pragma config FNOSC = FRCPLL           // Oscillator Selection Bits (Fast RC Osc with PLL)
#pragma config FSOSCEN = OFF            // Secondary Oscillator Enable (Disabled)
#pragma config IESO = OFF               // Internal/External Switch Over (Disabled)
#pragma config POSCMOD = OFF            // Primary Oscillator Configuration (Primary osc disabled)
#pragma config OSCIOFNC = OFF           // CLKO Output Signal Active on the OSCO Pin (Disabled)
#pragma config FPBDIV = DIV_1           // Peripheral Clock Divisor (Pb_Clk is Sys_Clk/1)
#pragma config FCKSM = CSDCMD           // Clock Switching and Monitor Selection (Clock Switch Disable, FSCM Disabled)
#pragma config WDTPS = PS1048576        // Watchdog Timer Postscaler (1:1048576)
#pragma config WINDIS = OFF             // Watchdog Timer Window Enable (Watchdog Timer is in Non-Window Mode)
#pragma config FWDTEN = OFF             // Watchdog Timer Enable (WDT Disabled (SWDTEN Bit Controls))
#pragma config FWDTWINSZ = WINSZ_25     // Watchdog Timer Window Size (Window Size is 25%)

// DEVCFG0
#pragma config JTAGEN = OFF             // JTAG Enable (JTAG Disabled)
#pragma config ICESEL = ICS_PGx1        // ICE/ICD Comm Channel Select (Communicate on PGEC1/PGED1)
#pragma config PWP = OFF                // Program Flash Write Protect (Disable)
#pragma config BWP = OFF                // Boot Flash Write Protect bit (Protection Disabled)
#pragma config CP = OFF                 // Code Protect (Protection Disabled)

// SYSTEM CLOCK 40MHz
// Peripheral Clock 40MHz
#include <xc.h>

#define BDOS 0x0400
#define BUNO 0x0800
#define AUNO 0x2000
#define ADOS 0x4000

void EnviarCaracter(char c);
void EnviarCadena(char c[], int a);
void IntTimer1(void);
void IntTimer4(void);
void IntTimer5(void);
void IntUart1(void);
void IntCN(void);
void SentidoLlantas(void);
void Velocidad(void);
void EnviarPasos(void);
void EnviarSentidos(void);
void EnviarTiempos(void);
void Radar(void);
void InicializarESP(void);
void Avanzar(void);


char charIn;
int i = 0;
int j = 0;
int k = 0;
int PasosDerF = 0;
int PasosIzqF = 0;
int PasosDerB = 0;
int PasosIzqB = 0;
int contTiemposIzq = 0;
int contTiemposDer = 0;
int DifTiempos = 0;
long TiempoActual = 0;
long TiempoPasadoDer = 0;
long TiempoPasadoIzq = 0;
long PromTiempos = 0;
int TiemposPasosDer[] = {0,0,0,0,0,0};
int TiemposPasosIzq[] = {0,0,0,0,0,0};
char SentidoActualIzq;
char SentidoActualDer;

char smsR[50];
int contR = 0;
int Revision = 0;

int dmil = 0;
int mil = 0;
int cen = 0;
int dec = 0;
int uni = 0;
int var;

int PasosESP = 1;
int InitESP = 1;

int blink = 0;

int ContarSonico1 = 0;
int ContarSonico2 = 0;
int TiempoSonico1 = 0;
int TiempoSonico2 = 0;
int Mandar = 0;
int Grados = 146;
int g = 0;

//Variables de prueba




void main(void) {
    
    //CLOCK INTERNO CON 40kHz en PBCLK
    
    OSCTUNbits.TUN  = 0b000000;         // Center Freq. Oscilator at 8MHz
    OSCCONbits.PLLODIV = 0b001;         // PLL out divided by 2
    OSCCONbits.FRCDIV = 0b000;          // FRC divided by 1
    OSCCONbits.SOSCRDY = 0b0;           // Secondary Osc is warming or turned off
    OSCCONbits.PBDIVRDY = 0b1;          // PBDIV bits can be written
    OSCCONbits.PBDIV = 0b00;            // PBCLK is SYSCLK divided by 1
    OSCCONbits.PLLMULT = 0b101;         // Clock is multiplied by 20
    OSCCONbits.COSC = 0b001;            // FRCPLL
    OSCCONbits.NOSC = 0b001;            // FRCPLL
    OSCCONbits.CLKLOCK = 0b0;           // Clock and PLL can be modify
    OSCCONbits.ULOCK = 0b0;             // USB is out of lock or is disabled
    OSCCONbits.SLOCK = 0b0;             // PLL Lock Status
    OSCCONbits.SLPEN = 0b0;             // Will enter in idle mode when WAIT is executed
    OSCCONbits.CF = 0b0;                // No clock failure has been detected
    OSCCONbits.UFRCEN = 0b0;            // Use the primary Osc or USB PLL as the USB clock source
    OSCCONbits.SOSCEN = 0b0;            // Disable secondary oscilator
    OSCCONbits.OSWEN = 0b0;             // Oscilator switch is complete  
    
    //CONFIGURACIÓN DE ENTRADAS Y SALIDAS
    
    ANSELA = 0;                         // Pines Digitales Puerto A
    ANSELB = 0;                         // Pines Digitales Puerto B
    
    TRISAbits.TRISA0 = 1;               // Pin 2 como entrada - ENC DERECHA A
    TRISAbits.TRISA1 = 1;               // Pin 3 como entrada - ENC DERECHA B
    TRISBbits.TRISB0 = 1;               // Pin 4 como entrada - ENC IZQUIERDA B
    TRISBbits.TRISB1 = 1;               // Pin 5 como entrada - ENC IZQUIERDA A
    TRISBbits.TRISB2 = 1;               // Pin 6 como entrada - UART RECEIVER
    TRISBbits.TRISB3 = 0;               // Pin 7 como salida - UART TRANSMITER
    TRISAbits.TRISA2 = 1;               // Pin 9 como entrada - MAXSONAR 1 
    TRISAbits.TRISA3 = 1;               // Pin 10 como entrada - MAXSONAR 2
    TRISBbits.TRISB4 = 0;               // Pin 11 como salida - 
    TRISAbits.TRISA4 = 0;               // Pin 12 como salida - 
    TRISBbits.TRISB5 = 0;               // Pin 14 como salida - LED 1
    TRISBbits.TRISB7 = 0;               // Pin 16 como salida - 
    TRISBbits.TRISB8 = 0;               // Pin 17 como salida - SERVO MOTOR
    TRISBbits.TRISB9 = 0;               // Pin 18 como salida - DRIVER PWM B
    TRISBbits.TRISB10 = 0;              // Pin 21 como salida - DRIVER B2
    TRISBbits.TRISB11 = 0;              // Pin 22 como salida - DRIVER B1
    TRISBbits.TRISB13 = 0;              // Pin 24 como salida - DRIVER A1
    TRISBbits.TRISB14 = 0;              // Pin 25 como salida - DRIVER A2
    TRISBbits.TRISB15 = 0;              // Pin 26 como salida - DRIVER PWM A
    
    // RE-MAPEO DE PINES
    
    CFGCONbits.IOLOCK = 0b0;            // IOLock is disabled.
    
    U1RXRbits.U1RXR = 0b0100;           // Se asigna RPB2 a U1RX - Receiver Uart - pin 6
    RPB3Rbits.RPB3R = 0b0001;           // Se asigna U1TX a RPB3 - Transmiter Uart - pin 7
    
