lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programas de Prueba/6. Progra Final Version 1.c
    RPB8Rbits.RPB8R = 0b0101;           // Se asigna OC2 a RPB8 - Servo - pin 17
    RPB9Rbits.RPB9R = 0b0101;           // Se asigna OC3 a RPB9 - Motor PWM B - pin 18
    RPB10Rbits.RPB10R = 0b0000;         // No se asigna nada - Motor Bin2  - pin 21
    RPB11Rbits.RPB11R = 0b0000;         // No se asigna nada - Motor Bin1 - pin 22
    RPB13Rbits.RPB13R = 0b0000;         // No se asigna nada - Motor Ain1 - pin 24
    RPB14Rbits.RPB14R = 0b0000;         // No se asigna nada - Motor Ain2 - pin 25
    RPB15Rbits.RPB15R = 0b0101;         // Se asigna OC1 a RPB15 - Motor PWM A - pin 26
    
    // CONFIGURACIÓN DE UART 1
    
    U1BRG = 4;                          // BaudRate = 2000000 at Fpb = 40 MHZ with BRGH = 1
    
    U1MODEbits.PDSEL = 0b00;            // No parity
    U1MODEbits.ON = 0b0;                // UART Disabled
    U1MODEbits.SIDL = 0b0;
    U1MODEbits.IREN = 0b0;
    U1MODEbits.RTSMD = 0b1;             // Simplex ModeA
    U1MODEbits.UEN = 0b00;
    U1MODEbits.WAKE = 0b0;
    U1MODEbits.LPBACK = 0b0;
    U1MODEbits.ABAUD = 0b0;
    U1MODEbits.RXINV = 0b0;
    U1MODEbits.BRGH = 0b1;              // High Speed Mode
    U1MODEbits.STSEL = 0b0;             // 1 stop bit   
    
    U1STAbits.URXISEL = 0b00;           // Se realiza una interrupción por cada caracter recibido
    U1STAbits.URXEN = 1;                // habilitar recepcion
    U1STAbits.UTXEN = 1;                // habilitar transmision
    
    // SE CONFIGURA TIMER 1
    
    T1CONbits.ON = 0b0;                 // Timer 1 is disabled
    T1CONbits.SIDL = 0b0;
    T1CONbits.TWDIS = 0b0;
    T1CONbits.TWIP = 0b0;
    T1CONbits.TGATE = 0b0;
    T1CONbits.TCKPS = 0b00;             // Prescaler at 1:1
    T1CONbits.TSYNC = 0b0;
    T1CONbits.TCS = 0b0;                // Internal Peripheral Clock as Timer Clock Source  
    
    //TIMER 2 ES PARA CONTROLAR LOS MOTORES
    
    T2CONbits.ON = 0b0;                 // Timer 2 is disabled
    T2CONbits.SIDL = 0b0;
    T2CONbits.TGATE = 0b0;
    T2CONbits.TCKPS = 0b100;            // Prescaler at 1:16
    T2CONbits.T32 = 0b0;
    T2CONbits.TCS = 0b0;                // Internal Peripheral Clock as Timer Clock Source
    
    //TIMER 3 ES PARA CONTROLAR AL SERVO
    
    T3CONbits.ON = 0b0;                 // Timer 3 is disabled
    T3CONbits.SIDL = 0b0;
    T3CONbits.TGATE = 0b0;
    T3CONbits.TCKPS = 0b011;            // Prescaler at 1:8
    T3CONbits.TCS = 0b0;                // Internal Peripheral Clock as Timer Clock Source
    
    //TIMER 4 ES PARA MEDIR LOS SENSORES DE DISTANCIA CADA 50ms
    
    T4CONbits.ON = 0b0;                 // Timer 4 is disabled
    T4CONbits.SIDL = 0b0;
    T4CONbits.TGATE = 0b0;
    T4CONbits.TCKPS = 0b101;            // Prescaler at 1:32
    T4CONbits.T32 = 0b0;
    T4CONbits.TCS = 0b0;                // Internal Peripheral Clock as Timer Clock Source
    
    //TIMER 5 ES PARA MEDIR EL TIEMPO DE LA SEÑAL PWM DE SENSORES DE DISTANCIA
    
    T5CONbits.ON = 0b0;                 // Timer 5 is disabled
    T5CONbits.SIDL = 0b0;
    T5CONbits.TGATE = 0b0;
    T5CONbits.TCKPS = 0b000;            // Prescaler at 1:1
    T5CONbits.TCS = 0b0;                // Internal Peripheral Clock as Timer Clock Source
    
    //PWM 1 PARA CONTROLAR MOTOR A
    
    OC1CONbits.ON = 0b0;                // OC1 is disabled
    OC1CONbits.SIDL = 0b0;
    OC1CONbits.OC32 = 0b0;
    OC1CONbits.OCFLT = 0b0;
    OC1CONbits.OCTSEL = 0b0;            // Timer 2 is the clock source
    OC1CONbits.OCM = 0b110;             // Estandar PWM
    
    //PWM 2 PARA CONTROLAR SERVO
    
    OC2CONbits.ON = 0b0;                // OC2 is disabled
    OC2CONbits.SIDL = 0b0;
    OC2CONbits.OC32 = 0b0;
    OC2CONbits.OCFLT = 0b0;
    OC2CONbits.OCTSEL = 0b1;            // Timer 3 is the clock source
    OC2CONbits.OCM = 0b110;             // Estandar PWM
    
    //PWM 3 PARA CONTROLAR MOTOR B
    
    OC3CONbits.ON = 0b0;                // OC3 is disabled
    OC3CONbits.SIDL = 0b0;
    OC3CONbits.OC32 = 0b0;
    OC3CONbits.OCFLT = 0b0;
    OC3CONbits.OCTSEL = 0b0;            // Timer 2 is the clock source
    OC3CONbits.OCM = 0b110;             // Estandar PWM
    
    // Definición de periodos de Timers
    // FreqPWM = FreqPB/[(PRx+1)*(TMR Prescale Value)]
    
    PR1 = 3999;                         // Cada 100uS se activa la interrupción del T1
    PR2 = 4999;                         // Freq de 500Hz (Motores)
    PR3 = 16666;                        // Freq de 300Hz (Servo) 4000-11300 / 0° - 140°
    PR4 = 62499;                        // Freq de 20Hz (Lectura de MaxSonar)
    PR5 = 998;                          // Freq de 40kHz (Conteo de tiempo de PWM MaxSonar)
    
    // Definición de Duty Cycle de PWM's
    
    OC1RS = 0;
    OC2RS = 4000;                       // 24% of PR3 to 67.8% of PR3 for Servo Traxxas
    OC3RS = 0;                      
    
    //INTERRUPTS CONFIG
    
    //Interrupción Timer 1
    IPC1bits.T1IP = 0b111;              // Prioridad de Interrupción 7
    IPC1bits.T1IS = 0b11;               // Sub-Prioridad de Interrupción 3
    
    //Interrupción Timer 4
    IPC4bits.T4IP = 0b111;              // Prioridad de Interrupción 7
    IPC4bits.T4IS = 0b11;               // Sub-Prioridad de Interrupción 3
    
    //Interrupción Timer 5
    IPC5bits.T5IP = 0b111;              // Prioridad de Interrupción 7
    IPC5bits.T5IS = 0b11;               // Sub-Prioridad de Interrupción 3
    
    //Interrupción UART
    IPC8bits.U1IP = 0b111;              // Prioridad de Interrupción 7
    IPC8bits.U1IS = 0b11;               // Sub-Prioridad de Interrupción 3
    
    //Interrupción Change Control Port A y B
    IPC8bits.CNIP = 0b111;              // Prioridad de Interrupción 7
    IPC8bits.CNIS = 0b11;               // Sub-Prioridad de Interrupción 3
    CNENAbits.CNIEA0 = 0b1;             // Change Control pin A0 Interrupt Enabled
    CNPUAbits.CNPUA0 = 0b0;             // Deshabilitar PULL UP en A0
    CNPDAbits.CNPDA0 = 0b1;             // Habilitar PULL DOWN en A0
    CNENAbits.CNIEA1 = 0b1;             // Change Control pin A1 Interrupt Enabled
    CNPUAbits.CNPUA1 = 0b0;             // Deshabilitar PULL UP en A1
    CNPDAbits.CNPDA1 = 0b1;             // Habilitar PULL DOWN en A1
    CNENBbits.CNIEB0 = 0b1;             // Change Control pin B0 Interrupt Enabled
    CNPUBbits.CNPUB0 = 0b0;             // Deshabilitar PULL UP en B0
    CNPDBbits.CNPDB0 = 0b1;             // Habilitar PULL DOWN en B0
    CNENBbits.CNIEB1 = 0b1;             // Change Control pin B1 Interrupt Enabled
    CNPUBbits.CNPUB1 = 0b0;             // Deshabilitar PULL UP en B1
    CNPDBbits.CNPDB1 = 0b1;             // Habilitar PULL DOWN en B1
    CNENAbits.CNIEA2 = 0b0;             // Change Control pin A2 Interrupt Disabled
    CNPUAbits.CNPUA2 = 0b0;             // Deshabilitar PULL UP en A2
    CNPDAbits.CNPDA2 = 0b1;             // Habilitar PULL DOWN en A2
    CNENAbits.CNIEA3 = 0b0;             // Change Control pin A3 Interrupt Disabled
    CNPUAbits.CNPUA3 = 0b0;             // Deshabilitar PULL UP en A3
    CNPDAbits.CNPDA3 = 0b1;             // Habilitar PULL DOWN en A3
    
    CNCONAbits.ON = 0b1;                // Change Control Notice ON portA
    CNCONBbits.ON = 0b1;                // Change Control Notice ON portB
    
    //HABILITACIÓN DE MÓDULOS
    
    OC1CONbits.ON = 0b1;                // OC1 is enabled
    OC2CONbits.ON = 0b1;                // OC2 is enabled
    OC3CONbits.ON = 0b1;                // OC3 is enabled  
    T1CONbits.ON = 0b1;                 // Timer 1 is enabled
    T1CONbits.TON = 0b1;
    T2CONbits.ON = 0b1;                 // Timer 2 is enabled
    T3CONbits.ON = 0b1;                 // Timer 3 is enabled
    T4CONbits.ON = 0b1;                 // Timer 4 is enabled
    T5CONbits.ON = 0b1;                 // Timer 5 is enabled
    U1MODEbits.ON = 0b1;                // UART Enabled
    
    // HABILITACIÓN DE INTERRUPCIONES
    
