lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programas de Prueba/6. Progra Final Version 1.c
    IEC0bits.T1IE = 0b1;                // Timer 1 Interrupt Enabled
    IEC1bits.U1RXIE = 0b1;              // UART 1 Receiver Interrupt Enabled
    IEC1bits.CNAIE = 0b1;               // Change Control PortA Interrupt Enabled
    IEC1bits.CNBIE = 0b1;               // Change Control PortB Interrupt Enabled
    
    // INHABILITACIÓN DE INTERRUPCIONES
    
    IEC0bits.T4IE = 0b0;                // Timer 4 Interrupt Disabled
    IEC0bits.T5IE = 0b0;                // Timer 5 Interrupt Disabled
    
    INTCONbits.MVEC = 0b1;              // Interrupt Controller for Multi-Vectored Mode
    
    // LIMPIEZA DE BANDERAS DE INTERRUPCIÓN
    
    IFS0bits.T1IF = 0b0;                // Interruption Flag of Timer 1 to 0
    IFS0bits.T4IF = 0b0;                // Interruption Flag of Timer 4 to 0
    IFS0bits.T5IF = 0b0;                // Interruption Flag of Timer 5 to 0
    IFS1bits.U1RXIF = 0b0;              // Interruption Flag of UART 1 Receiver to 0
    IFS1bits.CNAIF = 0b0;               // Interruption Flag of PORTA to 0
    IFS1bits.CNBIF = 0b0;               // Interruption Flag of PORTB to 0
    
    // LIMPIEZA DE SALIDAS
    
    LATACLR = 0x0010;
    LATBCLR = 0x0030;
   
    __builtin_enable_interrupts();      // Se habilitan las interrupciones
    
    //InicializarESP();
    
    while(1)
    {
        if(Revision == 2){
            for(i = 0; i < contR; i++){
                switch (smsR[i]){
                    case 's':
                        SentidoLlantas();
                        i++;
                        break;
                    case 'v':
                        Velocidad();
                        i += 5;
                        break;
                    case 'd':
                        EnviarSentidos();
                        break;
                    case 'p':
                        EnviarPasos();
                        break;
                    case 't':
                        EnviarTiempos();
                        break;
                    case 'r':
                        Radar();
                        break;
                    case 'a':
                        Avanzar();
                        break;
                    default:
                        EnviarCadena("Error: ",7);
                        EnviarCaracter(smsR[i]);
                        EnviarCadena("\r\n",2);
                        break;
                }
            }
            EnviarCadena("@\r\n",3);
            Revision = 0;
        }
    }
    return;
}

void Avanzar(void){
    
}

// Interrupción para detectar cambio de estado en A0, A1, B0 y B1 para encoders.
void __ISR (34, IPL7SOFT) IntCN(void)
{
    if(CNSTATAbits.CNSTATA0 && PORTAbits.RA0){   //Se activa en el rising del pin 2 - Enc 1A
        
        if(SentidoActualDer == 'f'){
            PasosDerF++;
        }else{
            PasosDerB++;
        }
        
        DifTiempos = TiempoActual - TiempoPasadoDer;
        
        TiempoPasadoDer = TiempoActual;
        
        if(DifTiempos < 65000){
            TiemposPasosDer[contTiemposDer++] = DifTiempos;
        }else{
            TiemposPasosDer[contTiemposDer++] = 65000;
        }
        
        if(contTiemposDer == 6){
            contTiemposDer = 0;
        }
        
    }
    if(CNSTATAbits.CNSTATA1 && PORTAbits.RA1){   //Se activa en el rising del pin 3 - Enc 1B
        
        if(PORTAbits.RA0){
            SentidoActualDer = 'b';              //Llanta derecha gira hacia atrás
        }else{
            SentidoActualDer = 'f';              //Llanta derecha gira hacia adelante
        }
        
    }
    if(CNSTATBbits.CNSTATB0 && PORTBbits.RB0){   //Se activa en el rising del pin 4 - Enc 2B
        
        if(PORTBbits.RB1){
            SentidoActualIzq = 'f';              //Llanta derecha gira hacia atrás
        }else{
            SentidoActualIzq = 'b';              //Llanta derecha gira hacia adelante
        }

    }
    if(CNSTATBbits.CNSTATB1 && PORTBbits.RB1){   //Se activa en el rising del pin 5 - Enc 2A
        
        if(SentidoActualIzq == 'f'){
            PasosIzqF++;
        }else{
            PasosIzqB++;
        }
        
        DifTiempos = TiempoActual - TiempoPasadoIzq;
        
        TiempoPasadoIzq = TiempoActual;
        
        if(DifTiempos < 65000){
            TiemposPasosIzq[contTiemposIzq++] = DifTiempos;
        }else{
            TiemposPasosIzq[contTiemposIzq++] = 65000;
        }
        
        if(contTiemposIzq == 6){
            contTiemposIzq = 0;
        }
    }
    
    
    if(CNSTATAbits.CNSTATA2){
        if(PORTAbits.RA2){                              //Se activa en el rising del pin 9 - MaxSonar 1
            ContarSonico1 = 0;
        }else{                                          //Se activa en el falling del pin 9 - MaxSonar 1
            TiempoSonico1 = ContarSonico1;
        }
    }
    
    if(CNSTATAbits.CNSTATA3){
        if(PORTAbits.RA3){                              //Se activa en el rising del pin 10 - MaxSonar 2
            ContarSonico2 = 0;
        }else{                                          //Se activa en el falling del pin 10 - MaxSonar 2
            TiempoSonico2 = ContarSonico2;
        }
    }
    
	IFS1bits.CNAIF = 0b0;                   // Resetear bandera de interrupción
    IFS1bits.CNBIF = 0b0;                   // Resetear bandera de interrupción
}

// Interrupción del Timer 4 se activa cada 50ms
void __ISR (16, IPL7SOFT) IntTimer4(void)
{
    
    Mandar = 1;
	IFS0bits.T4IF = 0;                  // Resetear bandera de interrupción
}

// Interrupción del Timer 5 se activa cada 25us
void __ISR (20, IPL7SOFT) IntTimer5(void)
{
    LATAINV = 0x0010;
    
    ContarSonico1++;
    ContarSonico2++;
    
	IFS0bits.T5IF = 0;                  // Resetear bandera de interrupción
}

void Radar(void){
    
    EnviarCadena("r\r\n",3);
    
    OC1RS = 0;
    OC3RS = 0;
    
    OC2RS = 4000;
    
    __builtin_disable_interrupts();
    
