lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programas de Prueba/6. Progra Final Version 1.c
    IEC0bits.T4IE = 0b1;                // Timer 4 Interrupt Enabled
    IEC0bits.T5IE = 0b1;                // Timer 5 Interrupt Enabled
    
    IEC1bits.CNAIE = 0b0;               // Change Control PortA Interrupt Disabled
    CNENAbits.CNIEA2 = 0b1;             // Change Control pin A2 Interrupt Enabled
    CNENAbits.CNIEA3 = 0b1;             // Change Control pin A3 Interrupt Enabled
    IEC1bits.CNAIE = 0b1;               // Change Control PortA Interrupt Enabled
    
    IFS0bits.T4IF = 0b0;                // Interruption Flag of Timer 4 to 0
    IFS0bits.T5IF = 0b0;                // Interruption Flag of Timer 5 to 0
    IFS1bits.CNAIF = 0b0;               // Interruption Flag of PORTA to 0
    
    __builtin_enable_interrupts();
    
    Grados = 0;
    
    while(Grados < 146){
        if(Mandar == 1){
            Mandar = 0;
            
            dmil = Grados;
            
            cen = dmil/100;
            dmil -= cen*100;
            dec = dmil/10;
            dmil -= dec*10;
            uni = dmil;
            
            dmil = TiempoSonico1;
            
            U1TXREG = cen+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = dec+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = uni+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = '\t';
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            
            mil = dmil/1000;
            dmil -= mil*1000;
            cen = dmil/100;
            dmil -= cen*100;
            dec = dmil/10;
            dmil -= dec*10;
            uni = dmil;
            
            dmil = TiempoSonico2;
            
            U1TXREG = mil+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = cen+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = dec+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = uni+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = '\t';
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            
            mil = dmil/1000;
            dmil -= mil*1000;
            cen = dmil/100;
            dmil -= cen*100;
            dec = dmil/10;
            dmil -= dec*10;
            uni = dmil;
            
            U1TXREG = mil+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = cen+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = dec+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = uni+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = '\r';
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = '\n';
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            
            Grados++;
        }
    }
    
    TiempoSonico1 = 0;
    TiempoSonico2 = 0;
    
    OC2RS = 4000;
    
    __builtin_disable_interrupts();
    
    IEC0bits.T4IE = 0b0;                // Timer 4 Interrupt Disabled
    IEC0bits.T5IE = 0b0;                // Timer 5 Interrupt Disabled
    
    IEC1bits.CNAIE = 0b0;               // Change Control PortA Interrupt Disabled
    CNENAbits.CNIEA2 = 0b0;             // Change Control pin A2 Interrupt Disabled
    CNENAbits.CNIEA3 = 0b0;             // Change Control pin A3 Interrupt Disabled
    IEC1bits.CNAIE = 0b1;               // Change Control PortA Interrupt Enabled
    
    IFS0bits.T4IF = 0b0;                // Interruption Flag of Timer 4 to 0
    IFS0bits.T5IF = 0b0;                // Interruption Flag of Timer 5 to 0
    IFS1bits.CNAIF = 0b0;               // Interruption Flag of PORTA to 0
    
    __builtin_enable_interrupts();
    
}

// Interrupción del Timer 1 se activa cada 0.1ms
void __ISR (4, IPL7SOFT) IntTimer1(void)
{
    
    if(InitESP == 1){
        blink++;
        
        if(PORTBbits.RB5){
            if(blink > 500){
                LATBCLR = 0x0020;
                blink = 0;
            }
        }else{
            if(blink > 49500){
                LATBSET = 0x0020;
                blink = 0;
            }
        }            
    }
    
    if(Grados < 146){
        g++;
        if(g == 10){
            g = 0;
            OC2RS++;  
        }
    }
    
    TiempoActual++;
    
	IFS0bits.T1IF = 0;                  // Resetear bandera de interrupción
}

// Interrupción del UART Transmisión y Recepción
void __ISR (32, IPL7SOFT) IntUart1(void)
{
    charIn = U1RXREG;
    
    if(InitESP == 0){
        if(charIn != '\n' && charIn != '\r'){
            smsR[contR++] = charIn;
            //Revision = 1;
        }else if(charIn == '\n'){
            Revision = 1;
            contR = 0;
        }        
    }else if (Revision == 1){
        if(charIn != '\n' && charIn != '\r' && contR < 50){
            smsR[contR++] = charIn;
        }else if(charIn == '\n'){
            Revision = 2;
        }
    }else if(charIn == ':'){
        Revision = 1;
        contR = 0;
    }

    IFS1bits.U1RXIF = 0b0;
}

//ENVIAR CARACTER POR SERIAL
void EnviarCaracter(char c) {
    __builtin_disable_interrupts();
    U1TXREG = c;
    while (!U1STAbits.TRMT);                //espera a que termine la transimision
    __builtin_enable_interrupts();
}

