lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programas de Prueba/6. Progra Final Version 1.c
//ENVIAR STRING POR SERIAL
void EnviarCadena(char p[], int a){
    for(k = 0; k < a; k++){
        EnviarCaracter(p[k]); 
    }
}

//Modifica el sentido en el que giran las llantas
void SentidoLlantas(void){
    
    switch(smsR[i+1]){
        case '1':            // Llantas hacia adelante
            LATBCLR = BDOS;
            LATBSET = BUNO;
            LATBCLR = AUNO;
            LATBSET = ADOS;
            break;
        case '2':            // Llanta derecha hacia adelante, izquierda hacia atrás
            LATBSET = BDOS;
            LATBCLR = BUNO;
            LATBCLR = AUNO;
            LATBSET = ADOS;
            break;
        case '3':            // Llanta derecha hacia atrás, izquierda hacia adelante
            LATBCLR = BDOS;
            LATBSET = BUNO;
            LATBSET = AUNO;
            LATBCLR = ADOS;
            break;
        case '4':            // Llantas hacia atrás
            LATBSET = BDOS;
            LATBCLR = BUNO;
            LATBSET = AUNO;
            LATBCLR = ADOS;
            break;
        default:
            break;
    }
    
    EnviarCadena("s\r\n",3);
    
}

// Modifica la velocidad de la llanta derecha o izquierda
void Velocidad(void){
     
    var = (smsR[i+2]-48)*1000 + (smsR[i+3]-48)*100 + (smsR[i+4]-48)*10 + smsR[i+5] - 48;
    
    if(var > 4500){
        var = 4500;
    }else if(var < 0){
        var = 0;
    }
    
    switch(smsR[i+1]){
        case 'd':
            OC1RS = var;
            break;
        case 'i':
            OC3RS = var;
            break;
        default:
            break;
    }
    
    EnviarCadena("v\r\n",3);
    
}

//Envía los pasos recorridos por las llantas
void EnviarPasos(void){
    
    EnviarCadena("p\r\n",3);
    
    dmil = PasosDerF/10000;
    PasosDerF -= dmil*10000;
    mil = PasosDerF/1000;
    PasosDerF -= mil*1000;
    cen = PasosDerF/100;
    PasosDerF -= cen*100;
    dec = PasosDerF/10;
    PasosDerF -= dec*10;
    uni = PasosDerF;
    PasosDerF -= uni;
    
    EnviarCadena("F\tD: ",5);
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    dmil = PasosIzqF/10000;
    PasosIzqF -= dmil*10000;
    mil = PasosIzqF/1000;
    PasosIzqF -= mil*1000;
    cen = PasosIzqF/100;
    PasosIzqF -= cen*100;
    dec = PasosIzqF/10;
    PasosIzqF -= dec*10;
    uni = PasosIzqF;
    PasosIzqF -= uni;
    
    EnviarCadena("\tI: ",4);
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    dmil = PasosDerB/10000;
    PasosDerB -= dmil*10000;
    mil = PasosDerB/1000;
    PasosDerB -= mil*1000;
    cen = PasosDerB/100;
    PasosDerB -= cen*100;
    dec = PasosDerB/10;
    PasosDerB -= dec*10;
    uni = PasosDerB;
    PasosDerB -= uni;
    
    EnviarCadena("\nB\tD: ",6);
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    dmil = PasosIzqB/10000;
    PasosIzqB -= dmil*10000;
    mil = PasosIzqB/1000;
    PasosIzqB -= mil*1000;
    cen = PasosIzqB/100;
    PasosIzqB -= cen*100;
    dec = PasosIzqB/10;
    PasosIzqB -= dec*10;
    uni = PasosIzqB;
    PasosIzqB -= uni;
    
    EnviarCadena("\tI: ",4);
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    EnviarCadena("\r\n",2);
    
}

//Envía en qué sentido están girando las llantas
void EnviarSentidos(void){

    EnviarCadena("d\r\n",3);
    
    EnviarCadena("D: ",3);
    EnviarCaracter(SentidoActualDer);
    EnviarCadena("\tI: ",4);
    EnviarCaracter(SentidoActualIzq);
    
    EnviarCadena("\r\n",2);
    
}

void EnviarTiempos(void){
    
    EnviarCadena("t\r\n",3);
    
    PromTiempos = 0;
    
    for(j = 0; j <6; j++){
        PromTiempos += TiemposPasosDer[j];
    }
    
    PromTiempos /= 6;
    
    dmil = PromTiempos/10000;
    PromTiempos -= dmil*10000;
    mil = PromTiempos/1000;
    PromTiempos -= mil*1000;
    cen = PromTiempos/100;
    PromTiempos -= cen*100;
    dec = PromTiempos/10;
    PromTiempos -= dec*10;
    uni = PromTiempos;
    PromTiempos -= uni;
    
    EnviarCadena("D: ",3);
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    for(j = 0; j <6; j++){
        PromTiempos += TiemposPasosIzq[j];
    }
    
    PromTiempos /= 6;
    
    dmil = PromTiempos/10000;
    PromTiempos -= dmil*10000;
    mil = PromTiempos/1000;
    PromTiempos -= mil*1000;
    cen = PromTiempos/100;
    PromTiempos -= cen*100;
    dec = PromTiempos/10;
    PromTiempos -= dec*10;
    uni = PromTiempos;
    PromTiempos -= uni;
    
    EnviarCadena("\tI: ",4);
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    EnviarCadena("\r\n",2);
    
}

// Configuración para Inicializar WIFI ESP
void InicializarESP(void){
    
    LATBSET = 0x0020;    
    EnviarCadena("AT+RST\r\n",8);                               //Resetea Módulo Wifi
    PasosESP = 1;
    contR = 0;
    InitESP = 0;
    
    while(InitESP == 0){
        if(Revision == 1){
            switch(PasosESP){            
                case 1:
                    if(smsR[0]=='r' && smsR[1]=='e' && smsR[2]=='a' && smsR[3]=='d' && smsR[4]=='y'){
                        smsR[0] = '@';
                        Revision = 0;
                        EnviarCadena("ATE0\r\n",6);                 //Desactivar echo de serial
                        PasosESP++;
                    }
                    break;

                case 2:
                    if(smsR[0]=='O' && smsR[1]=='K'){
                        smsR[0] = '@';
                        Revision = 0;
                        EnviarCadena("AT+CWMODE_CUR=1\r\n",17);     //Modo cliente
                        PasosESP++;
                    }
                    break;

                case 3:
                    if(smsR[0]=='O' && smsR[1]=='K'){
                        smsR[0] = '@';
                        Revision = 0;
                        EnviarCadena("AT+CWJAP_CUR=\"Megaproyecto\",\"ABC1234567\"\r\n",42);  //Conectarse a la red
                        PasosESP++;
                    }
                    break;

                case 4:
                    if(smsR[0]=='O' && smsR[1]=='K'){
                        smsR[0] = '@';
                        Revision = 0;
                        EnviarCadena("AT+CIFSR\r\n",10);            //Obtener IP
                        PasosESP++;
                    }
                    break;

                case 5:
                    if(smsR[0]=='O' && smsR[1]=='K'){
                        smsR[0] = '@';
                        Revision = 0;
                        EnviarCadena("AT+CIPSTART=\"TCP\",\"192.168.1.2\",5400\r\n",38);      //Iniciar cliente TCP
                        PasosESP++;
                    }
                    break;
                case 6:
                    if(smsR[0]=='O' && smsR[1]=='K'){
                        smsR[0] = '@';
                        Revision = 0;
                        InitESP = 1;
                        PasosESP = 0;
                        LATBCLR = 0x0020;
                    }
                default:
                    break;
            }
        }
    }
}